{
  "basics": {
    "name": "Ben Cox",
    "label": "Recent Grad",
    "picture": "https://github.com/benrgcox.png",
    "email": "bencox012@gmail.com",
    "phone": "(207)329-8800",
    "website": "https://benrgcox.github.io",
    "summary": "I am a recent 2024 graduate from Boston University with a B.S. in Data Science. I love algorithms, data systems, space sciences, and am always eager to learn more.",
    "location": { "address": "", "postalCode": "", "city": "Cambridge", "countryCode": "USA", "region": "Massachusetts" },
    "profiles": [
      { "network": "github", "username": "benrgcox", "url": "http://github.com/benrgcox" },
      { "network": "linkedin", "username": "benrgcox", "url": "http://www.linkedin.com/in/benrgcox/" }
    ]
  },
  "interests": [
    { "name": "Data Science" },
    { "name": "Neural Networks" },
    { "name": "Robotics Systems" },
    { "name": "Algorithms & ML" },
    { "name": "Space Sciences" }
  ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "keywords": [ "Python", "R", "SQL", "Rust"]
    },
    {
      "name": "Toolsets/OS",
      "keywords": [ "Windows", "MacOS", "Git/GitHub", "Google Suite", "Ubuntu" ]
    }
  ],
  "education": [
    {
      "institution": "Boston University, Boston, MA",
      "area": "Data Science",
      "studyType": "B.S.",
      "startDate": "2020",
      "endDate": "2024",
      "courses": [
      ]
    }
  ],
  "work": [
    {
      "company": "",
      "position": "Property Analyst",
      "website": "",
      "startDate": "2024-01-01",
      "endDate": "2024-05-01",
      "summary": "BU Spark! with the Boston Climate Action Network",
      "highlights": [
        "Analyzed climate emission data from Boston buildings to determine contributing factors to energy usage and compliance with Boston climate policy regulation.",
        "Worked with project members to provide overviews and detailed visualizations of emission factors, neighborhoods for improvement, missing data, and trends in data.",
        "Reported conclusions and group presentation to BCAN staff project coordinators for future use in data collection and project focus."
      ]
    },
    {
      "company": "",
      "position": "Data Science Teaching Assistant",
      "website": "",
      "startDate": "2024-01-01",
      "endDate": "2024-05-01",
      "summary": "Boston University Faculty of Computing & Data Sciences",
      "highlights": [
        "Selected to work with Professor of Faculty of Computing and Data Sciences to grade and teach distributions and statistical reasoning.",
        "Created and taught presentations with fellow TA to enhance lectures during discussion classes.",
        "Supported individual learning with one-on-one aid and tutoring."
      ]
    },
    {
      "company": "",
      "position": "L.L.Bean IS Platform Services Intern",
      "website": "",
      "startDate": "2023-05-01",
      "endDate": "2023-08-01",
      "summary": "Summer Internship",
      "highlights": [
        "Created a Cloud Kubernetes billing visualization tool in Google Cloud using SQL and Python queries to give greater cost transparency and automate reporting to project managers.",
        "Interviewed software vendors for potential involvement in project.",
        "Collaborated with team of Cloud architects and partners to deliberate, update, expand, and troubleshoot on systems within Google Cloud.",
        "Learned the inner workings of a corporate business context, from project brainstorming to development, application, review, and final production."
      ]
    },
    {
      "company": "",
      "position": "Software Systems Team Lead & Member",
      "website": "",
      "startDate": "2022-01-01",
      "endDate": "2024-05-01",
      "summary": "Boston University Mars Rover Club",
      "highlights": [
        "Planned robot path planning and obstacle avoidance navigation systems to allow the rover to pass through checkpoints as part of the University Rover Challenge.",
        "Designed algorithm code using data from depth-sensing camera to use in obstacle detection",
        "Coordinated with team members to facilitate effective implementation of sub-team projects."
      ]
    },
    {
      "company": "",
      "position": "Research and Data Collection Intern",
      "website": "",
      "startDate": "2019-05-01",
      "endDate": "2019-08-01",
      "summary": "Maine Research Internships for Teachers and Students (MERITS)",
      "highlights": [
        "Collected data about outgassing of potential plastics for CubeSat satellite construction for potential use in advancing Maine educational space sciences.",
        "Coordinated experiments with coworker at the University of Southern Maine physics lab.",
        "Organized and analyzed material data to determine ideal plastic for CubeSat experiments in lower Earth orbit.",
        "Presented findings and conclusions to 50+ professors, faculty, fellow researchers, and community members at an end-of-summer symposium."
      ]
    }
  ],
  "experiences": [
    {
      "organization": "Hmmmmmmmmm",
      "website": "Really?",
      "position": "Interesting...",
      "startDate": "2016-01-01",
      "endDate": "Present",
      "summary": "Lead developer for weather sensing project",
      "highlights": [
        "Design firmware for distributed weather sensor network",
        "Maintain custom data collection and storage infrastructure"
      ]
    }
  ],
  "awards": [
    {
      "title": "Boston University Dean's List",
      "date": "Spring 2022-Spring 2024",
      "awarder": "Boston University",
      "summary": "Distinction for achieving a GPA above a 3.5 out of courses taken during each semester."
    },
    {
      "title": "National Honors Society Member",
      "date": "2020",
      "awarder": "National Honors Society",
      "summary": "Scholarship and designation awarded to graudating high school seniors who complete challenging courseloads with a minimum overall GPA of 93, volunteer service to both school and community, and must \"demonstrate leadership and oustanding character\"."
    },
    {
      "title": "STEM Endorsement",
      "date": "2020",
      "awarder": "Portland High School",
      "summary": "Designation for high school seniors who graduate with a specific focus or concentration within STEM fields."
    }
  ],
  "references": [
    {
      "name": "Available upon request"
    }
  ]
}
